GigaDevice-GD32-MCU/GD32A10x_Firmware_Library/Firmware/GD32A10x_standard_peripheral/Include/gd32a10x_can.h
/* CAN time segment 2 */
#define CAN_BT_BS2_1TQ                     ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_BT_BS2_2TQ                     ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_BT_BS2_3TQ                     ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_BT_BS2_4TQ                     ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_BT_BS2_5TQ                     ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_BT_BS2_6TQ                     ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_BT_BS2_7TQ                     ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_BT_BS2_8TQ                     ((uint8_t)0x07U)             /*!< 8 time quanta */
#define CAN_BT_BS2_9TQ                     ((uint8_t)0x08U)             /*!< 9 time quanta */
#define CAN_BT_BS2_10TQ                    ((uint8_t)0x09U)             /*!< 10 time quanta */
#define CAN_BT_BS2_11TQ                    ((uint8_t)0x0AU)             /*!< 11 time quanta */
#define CAN_BT_BS2_12TQ                    ((uint8_t)0x0BU)             /*!< 12 time quanta */
#define CAN_BT_BS2_13TQ                    ((uint8_t)0x0CU)             /*!< 13 time quanta */
#define CAN_BT_BS2_14TQ                    ((uint8_t)0x0DU)             /*!< 14 time quanta */
#define CAN_BT_BS2_15TQ                    ((uint8_t)0x0EU)             /*!< 15 time quanta */
#define CAN_BT_BS2_16TQ                    ((uint8_t)0x0FU)             /*!< 16 time quanta */
#define CAN_BT_BS2_17TQ                    ((uint8_t)0x10U)             /*!< 17 time quanta */
#define CAN_BT_BS2_18TQ                    ((uint8_t)0x11U)             /*!< 18 time quanta */
#define CAN_BT_BS2_19TQ                    ((uint8_t)0x12U)             /*!< 19 time quanta */
#define CAN_BT_BS2_20TQ                    ((uint8_t)0x13U)             /*!< 20 time quanta */
#define CAN_BT_BS2_21TQ                    ((uint8_t)0x14U)             /*!< 21 time quanta */
#define CAN_BT_BS2_22TQ                    ((uint8_t)0x15U)             /*!< 22 time quanta */
#define CAN_BT_BS2_23TQ                    ((uint8_t)0x16U)             /*!< 23 time quanta */
#define CAN_BT_BS2_24TQ                    ((uint8_t)0x17U)             /*!< 24 time quanta */
#define CAN_BT_BS2_25TQ                    ((uint8_t)0x18U)             /*!< 25 time quanta */
#define CAN_BT_BS2_26TQ                    ((uint8_t)0x19U)             /*!< 26 time quanta */
#define CAN_BT_BS2_27TQ                    ((uint8_t)0x1AU)             /*!< 27 time quanta */
#define CAN_BT_BS2_28TQ                    ((uint8_t)0x1BU)             /*!< 28 time quanta */
#define CAN_BT_BS2_29TQ                    ((uint8_t)0x1CU)             /*!< 29 time quanta */
#define CAN_BT_BS2_30TQ                    ((uint8_t)0x1DU)             /*!< 30 time quanta */
#define CAN_BT_BS2_31TQ                    ((uint8_t)0x1EU)             /*!< 31 time quanta */
#define CAN_BT_BS2_32TQ                    ((uint8_t)0x1FU)             /*!< 32 time quanta */

/* CAN  date bit resynchronisation jump width */
#define CAN_DBT_SWJ_1TQ                     ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_DBT_SWJ_2TQ                     ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_DBT_SWJ_3TQ                     ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_DBT_SWJ_4TQ                     ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_DBT_SWJ_5TQ                     ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_DBT_SWJ_6TQ                     ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_DBT_SWJ_7TQ                     ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_DBT_SWJ_8TQ                     ((uint8_t)0x07U)             /*!< 8 time quanta */

/* CAN date bit time segment 1 */
#define CAN_DBT_DBS1_1TQ                   ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_DBT_DBS1_2TQ                   ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_DBT_DBS1_3TQ                   ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_DBT_DBS1_4TQ                   ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_DBT_DBS1_5TQ                   ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_DBT_DBS1_6TQ                   ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_DBT_DBS1_7TQ                   ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_DBT_DBS1_8TQ                   ((uint8_t)0x07U)             /*!< 8 time quanta */
#define CAN_DBT_DBS1_9TQ                   ((uint8_t)0x08U)             /*!< 9 time quanta */
#define CAN_DBT_DBS1_10TQ                  ((uint8_t)0x09U)             /*!< 10 time quanta */
#define CAN_DBT_DBS1_11TQ                  ((uint8_t)0x0AU)             /*!< 11 time quanta */
#define CAN_DBT_DBS1_12TQ                  ((uint8_t)0x0BU)             /*!< 12 time quanta */
#define CAN_DBT_DBS1_13TQ                  ((uint8_t)0x0CU)             /*!< 13 time quanta */
#define CAN_DBT_DBS1_14TQ                  ((uint8_t)0x0DU)             /*!< 14 time quanta */
#define CAN_DBT_DBS1_15TQ                  ((uint8_t)0x0EU)             /*!< 15 time quanta */
#define CAN_DBT_DBS1_16TQ                  ((uint8_t)0x0FU)             /*!< 16 time quanta */

/* CAN date bit time segment 2 */
#define CAN_DBT_DBS2_1TQ                   ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_DBT_DBS2_2TQ                   ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_DBT_DBS2_3TQ                   ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_DBT_DBS2_4TQ                   ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_DBT_DBS2_5TQ                   ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_DBT_DBS2_6TQ                   ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_DBT_DBS2_7TQ                   ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_DBT_DBS2_8TQ                   ((uint8_t)0x07U)             /*!< 8 time quanta */

/* CAN mailbox number */
#define CAN_MAILBOX0                       ((uint8_t)0x00U)             /*!< mailbox0 */
#define CAN_MAILBOX1                       ((uint8_t)0x01U)             /*!< mailbox1 */
#define CAN_MAILBOX2                       ((uint8_t)0x02U)             /*!< mailbox2 */
#define CAN_NOMAILBOX                      ((uint8_t)0x03U)             /*!< no mailbox empty */

/* CAN frame format */
#define CAN_FF_STANDARD                    ((uint32_t)0x00000000U)      /*!< standard frame */
#define CAN_FF_EXTENDED                    ((uint32_t)0x00000004U)      /*!< extended frame */

/* CAN receive fifo */
#define CAN_FIFO0                          ((uint8_t)0x00U)             /*!< receive FIFO0 */
#define CAN_FIFO1                          ((uint8_t)0x01U)             /*!< receive FIFO1 */

